#!/usr/bin/bash

# Функция для вывода справки
show_help() {
    echo "Использование: script.sh [опции]"
    echo "Опции:"
    echo "  --host        Показать информацию о хосте"
    echo "  --user        Показать информацию о пользователе"
    echo "  -h, --help    Показать help"
}

# Функция для вывода информации о хосте
show_host_info() {
	echo "=========================================================================================================="
	echo "=========================================== Информация о хосте ==========================================="
	echo "=========================================================================================================="
	echo ""
	
	# CPU информация
    echo "----------------------------------------- Информация о процессоре ----------------------------------------"
    echo "  Количество ядер процессора: $(nproc)"
	echo "----------------------------------------------------------------------------------------------------------"
    echo ""
	
	# Информация о ОЗУ
	echo "------------------------------------------- Информация о памяти ------------------------------------------"
	awk '/MemTotal:/{t=$2} /MemAvailable:/{a=$2} END {u=t-a; printf "  Оперативная память: Всего=%.1fGB, Используется=%.1fGB (%.2f%%)\n", t/1024/1024, u/1024/1024, (u/t)*100}' /proc/meminfo
	echo "----------------------------------------------------------------------------------------------------------"
	echo ""
	
	# Информация о дисках
	echo "------------------------------------------ Информация о дисках -------------------------------------------"
	df -h | awk 'BEGIN {
					printf "  %-20s %-10s %-15s %-15s %-20s %s\n", "Диск", "Размер", "Использовано", "Свободно", "Использовано %", "Точка монтирования"
					printf "  %-20s %-10s %-15s %-15s %-20s %s\n", "--------------------", "----------", "---------------", "---------------", "--------------------", "-------------------"
				}
				NR>1 {
					printf "  %-20s %-10s %-15s %-15s %-20s %s\n", $1, $2, $3, $4, $5, $6
				}'
	echo ""
	echo "------------------------------------------- Ошибки на дисках: --------------------------------------------"
    dmesg | grep -i "disk error" | wc -l | awk '{print "  найденные ошибки на дисках: " $1}'
	echo "----------------------------------------------------------------------------------------------------------"
	echo ""
	
	# Информация о средней загрузке системы за последние 1, 5 и 15 минут
	echo "----------------------------- Загрузка системы за последние 1, 5 и 15 минут ------------------------------"
	awk '{print "  Средняя загрузка: " $1 ", " $2 ", " $3}' /proc/loadavg
	echo "----------------------------------------------------------------------------------------------------------"
	echo ""
	
	# Информация о текущем времени
	echo "---------------------------------------------- Текущее время ---------------------------------------------"
    echo "  $(date)"
	echo "----------------------------------------------------------------------------------------------------------"
    echo ""
	
	# Информация о времени работы системы (uptime)
	echo "---------------------------- Время работы системы (дни, часы, минуты, секунды) ---------------------------"
	awk '{s=int($1); printf "  %d:%02d:%02d:%02d\n", s/86400, (s%86400)/3600, (s%3600)/60, s%60}' /proc/uptime
	echo "----------------------------------------------------------------------------------------------------------"
	echo ""
	
	# Информация о сетевых интерфейсах
	echo "------------------------------------------- Сетевая информация -------------------------------------------"
	ip -br a | awk 'BEGIN {
						# Заголовки столбцов
						printf "  %-20s %-30s %-40s %s\n", "Интерфейс", "ipv4", "ipv6", "Статус";
						printf "  %-20s %-30s %-40s %s\n", "--------------------", "------------------------------", "----------------------------------------", "-----------";
					}
					{
						ipv4 = "";
						ipv6 = "";
						status = $2;
						interface = $1;
				
						for (i=3; i<=NF; i++) {
							if ($i ~ /^[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+\//) {
								ipv4 = $i;
							} else if ($i ~ /:/) {
								ipv6 = $i;
							}
						}
    
						# цвет для статуса интерфейса
						color = (status == "UP") ? "\033[32m" : "";
						reset = "\033[0m";
    
						printf "  %-20s %-30s %-40s %s%s%s\n", interface, ipv4, ipv6, color, status, reset;
					}'
	echo ""
	awk 'BEGIN {
			printf "  %-20s %30s %10s %30s %10s\n", "Интерфейс", "Получено (пакетов)", "Ошибки", "Передано (пакетов)", "Ошибки"
			printf "  %-20s %30s %10s %30s %10s\n", "--------------------", "------------------------------", "----------", "------------------------------", "----------"
		}
		NR > 2 {
			gsub(/:/, "", $1);
			printf "  %-20s %30s %10s %30s %10s\n", $1 ":", $3, $4, $11, $12
		}' /proc/net/dev
	echo "----------------------------------------------------------------------------------------------------------"
	echo ""
	
	# Информация о прослушиваемых портах
	echo "------------------------------------------ Прослушиваемые порты ------------------------------------------"
	ss -tulnp | awk ' BEGIN {
			printf "  %s %10s %10s\n", "Номер порта", "Протокол", "Процесс"
			printf "  %s %10s %10s\n", "-----------", "----------", "----------"
		}
		NR>1 {
			split($5, a, ":"); 
			port = a[length(a)]; 			
			split($7, b, "\""); 
			process = b[2] ? b[2] : "unknown";
			printf "  \033[1;32m%-6s\033[0m %15s %10s\n", port , $1, process
	}'
	echo "----------------------------------------------------------------------------------------------------------"
	echo "=========================================================================================================="
	echo ""
}

# Функция для вывода информации о пользователях
show_user_info() {
	echo "=========================================================================================================="
	echo "======================================= Информация о пользователях ======================================="
	echo "=========================================================================================================="
	echo ""
    
    # Список пользователей
	echo "-------------------------------------------- Все пользователи --------------------------------------------"
	awk -F: 'BEGIN {
			printf "  %-20s %s\n", "Логин", "UID"
			printf "  %-20s %s\n", "--------------------", "----------"
		}
		{
			printf "  %-20s %s\n",  $1, $3
		}' /etc/passwd
	echo "----------------------------------------------------------------------------------------------------------"
    echo ""
    
	# Пользователи с sudo-привилегиями (из групп wheel, adm, admin, sudo)
    echo "------------------------------------ Пользователи с sudo-привилегиями  -----------------------------------"
    {
        for group in wheel adm admin sudo; do
            if grep -q "^$group:" /etc/group; then
                echo "Пользователи группы $group:"
                grep "^$group:" /etc/group | cut -d: -f4 | tr ',' '\n' | sort | uniq
                echo ""
            fi
        done
    } | sed '/^$/d'  # Удаляем лишние пустые строки
	echo "----------------------------------------------------------------------------------------------------------"
    echo ""
    
    # Залогиненные пользователи
    echo "---------------------------------------- Залогиненные пользователи ---------------------------------------"
    who | awk '{print $1 " (удаленный хост " $5 " время входа " $3 " " $4 ")"}'
	echo "----------------------------------------------------------------------------------------------------------"
	echo "=========================================================================================================="
    echo ""
}

# Объявление длинных ключей
OPTIONS=$(getopt -o "h" -l "help,host,user" -- "$@") || {
	show_help
	exit 1
}

# Вывод help если не передали значения
if [[ $# -eq 0 ]]; then
  show_help
  exit 0
fi

# Парсинг аргументов
eval set -- "$OPTIONS"
# Обработка аргументов
while true; do
  case "$1" in
	--host)
	  show_host_info
      shift
	  ;;
	--user)
	  show_user_info
      shift 
	  ;;
    -h|--help)
      show_help
	  shift
      exit 0 ;;
    --)
      shift
      break 
	  ;;
    *)
      echo "Неправильный аргумент"
	  show_help
      exit 1 ;;
  esac
done